const {getRandomNumber, createComments} = require("./utils");

const descriptions = [
    'Хто зна коли вже в крипті бичка почнеться? пишіть в лс!',
    'Огооо!це шо за фільтр',
    'Краще б котіка своткав)',
    'Мур))',
    'АВТАМАБІІІЛЬ!!!',
    'Хто мені почеше спинку?)',
    'Йомайо!!вот єто тєєма!!',
    'Коли я був малим мені батя на голову вронив ключ на 47:(',
    'СТАВКИНАСПОРТ!',
    'Всьо з тобой понятно',
    'Го брити хомяків!',
    'Хто мен пояснить в чому тут смисол?',
    'Куплю біток по 15,пишіть',
    'LIKE A BOSS',
    'GussiGang',
    'У всіх є корєш якого тягне на пригоди?',
    'Хто відповість в чому прикол відправлю морозиво!',
    'І таке буває)',
    'В дитинстві мріяв бути космонавтом)',
    'Зацініть яка перспектива!',
    'Вдома в лузі паслись гусі)',
    'Бро чекни закрЄп!',
    'Це мій корЄфанчик!!',
    'Она куріт айкос а я курю кокс,нанана.',
    'Гарна як машина пожарна!',
    'Як виглядаю?'
]
const comments = [
    'Все відмінно!',
    'Загалом все непогано. Але не всі.',
    'Коли ви робите фотографію, добре б прибирати палець із кадру. Зрештою, це просто непрофесійно.',
    'Моя бабуся випадково чхнула з фотоапаратом у руках і у неї вийшла фотографія краща.',
    'Я послизнувся на банановій шкірці і впустив фотоапарат на кота і у мене вийшла фотографія краще.',
    'Обличчя людей на фотці перекошені, ніби їх побивають. Як можна було зловити такий невдалий момент?',
    'Хто зна коли вже в крипті бичка почнеться? пишіть в лс!',
    'Огооо!це шо за фільтр',
    'Краще б котіка своткав)',
    'Мур))',
    'АВТАМАБІІІЛЬ!!!',
    'Хто мені почеше спинку?)',
    'Йомайо!!вот єто тєєма!!',
    'Коли я був малим мені батя на голову вронив ключ на 47:(',
    'СТАВКИНАСПОРТ!',
    'Всьо з тобой понятно',
    'Го брити хомяків!',
    'Хто мен пояснить в чому тут смисол?',
    'Куплю біток по 15,пишіть',
    'LIKE A BOSS',
    'GussiGang',
    'У всіх є корєш якого тягне на пригоди?',
    'Хто відповість в чому прикол відправлю морозиво!',
    'І таке буває)',
    'В дитинстві мріяв бути космонавтом)',
    'Зацініть яка перспектива!',
    'Вдома в лузі паслись гусі)',
    'Бро чекни закрЄп!',
    'Це мій корЄфанчик!!',
    'Она куріт айкос а я курю кокс,нанана.',
    'Гарна як машина пожарна!',
    'Як виглядаю?'
]
const names = [
    'КриптоГусь',
    'Вуйко',
    'Інокентій',
    'БОГДАН',
    'Жорік',
    'Міхуіл',
    'Ніколай',
    'Іван',
]
const likesCount = {
    min: 15,
    max: 200
};
const commentsCount = {
    min: 1,
    max: 12
};//тут было число а не обьект,причина ошибки
const photosCount = {
    min: 1,
    max: 6
};
const publicationsCount = 26;

const publications = new Array(publicationsCount).fill(null).map((_, i) => ({
    id: i + 1,
    url: `photos/${i + 1}.jpg`,
    description: descriptions[i],
    likes: getRandomNumber(likesCount.min, likesCount.max),
    comments: createComments(+getRandomNumber(commentsCount.min, commentsCount.max),photosCount,comments,names)
}))
//   comments: createComments(+getRandomNumber(commentsCount.min, commentsCount.max),photosCount,comments,names)
//FFFFFFFFFFuck!+
module.exports = {publications,commentsCount,photosCount,comments,names}

